/*
What is the Big O notation for Function findStudentById . Explain your reason.
Answer:
//ฟังก์ชัน findStudentById คือ O(n) เพราะฟังก์ชันจะวนลูปจากรายชื่อนักเรียนทีละคนจนกว่าจะพบค่าที่ตรงกับค่า argument ที่หาหรือ return null ในกรณีที่หาไม่เจอ ซึ่งแปรผันตามจำนวนของ argument
𝑛
n.

*/

/* 
What is the Big O notation for Function findProductPrice. Explain your reason.
Answer:
//ฟังก์ชัน findProductPrice คือ O(n) เพราะฟังก์ชันจะวนลูปจากรายชื่อนักเรียนทีละคนจนกว่าจะพบค่าที่ตรงกับค่า argument ที่หาหรือ return -1 ในกรณีที่หาไม่เจอ ซึ่งแปรผันตามจำนวนของ argument


*/

/* 
Which function is more efficient and why?
Answer:
efficient เท่ากันเพราะจากโจทย์ข้อ1 มีการเรียงลำดับจาก id และโจทย์ข้อ2 มีการเรียงลำดับจาก A-Z ซึ่งทำให้ใช้ liner search ไม่ต้องใช้ binary search ทั้งคู่

*/
